
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТекДата = НачалоДня(ТекущаяДата());
	
	НаборЗаписей = РегистрыСведений.ЦеныНаУслуги.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекДата);
	НаборЗаписей.Отбор.Услуга.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекДата;
		Запись.Услуга = ТекущийОбъект.Ссылка;
		Запись.Цена = Цена;
		
		ЕстьИзменения = Истина;
	Иначе
		Запись = НаборЗаписей[0];
		
		Если Запись.Цена <> Цена Тогда
			Запись.Цена = Цена;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНаУслугиСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаУслуги.СрезПоследних КАК ЦеныНаУслугиСрезПоследних
		|ГДЕ
		|	ЦеныНаУслугиСрезПоследних.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЕсли;	

КонецПроцедуры
