

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если Параметры.Ключ.Пустая() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.РежимРаботы.Количество() = 0 Тогда
		ЗаполнитьДниНеделиСЧасами();
	КонецЕсли;
	
КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьДниНеделиСЧасами()

	ОбъектМетаданных = Метаданные.Перечисления.ДниНедели;
	
	Для каждого ЗначениеПеречисления Из ОбъектМетаданных.ЗначенияПеречисления Цикл
		СтрокаТЧ = Объект.РежимРаботы.Добавить();
		СтрокаТЧ.ДеньНедели = Перечисления.ДниНедели[ЗначениеПеречисления.Имя];
		СтрокаТЧ.ВремяНачала = '000101010900';	
		СтрокаТЧ.ВремяОкончания = '000101011900';	
	КонецЦикла;


КонецПроцедуры // ЗаполнитьДниНеделиСЧасами()

